app/controllers/don_nhap_hangs_controller.rb

  def set_don_nhap_hang
    @don_nhap_hang = DonNhapHang.find(params[:id])
---
SELECT "don_nhap_hangs".* FROM "don_nhap_hangs" WHERE "don_nhap_hangs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]