app/controllers/hang_hoas_controller.rb

  def index
    @hang_hoas = HangHoa.all
---
SELECT "hang_hoas".* FROM "hang_hoas"

  def create
    @hang_hoa = HangHoa.new(hang_hoa_params)

    if @hang_hoa.save
---
INSERT INTO "hang_hoas" ("MaHH", "TenHH", "SoLuong", "MaKho", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["MaHH", "HH001"], ["TenHH", "trái cây"], ["SoLuong", 5], ["MaKho", "001"], ["created_at", "2023-10-31 08:27:32.278764"], ["updated_at", "2023-10-31 08:27:32.278764"]]

  def destroy
    @hang_hoa.destroy
---
DELETE FROM "hang_hoas" WHERE "hang_hoas"."id" = ?  [["id", 1]]

  def set_hang_hoa
    @hang_hoa = HangHoa.find(params[:id])
---
SELECT "hang_hoas".* FROM "hang_hoas" WHERE "hang_hoas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]