app/controllers/khos_controller.rb

SELECT "khos".* FROM "khos"
---
  def index
    @khos = Kho.all

INSERT INTO "khos" ("id", "MaKho", "MaQL", "TenKho", "SLTonKho", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["id", nil], ["MaKho", "K001"], ["MaQL", "QL001"], ["TenKho", "kho hàng"], ["SLTonKho", 5], ["created_at", "2023-10-31 08:33:26.337332"], ["updated_at", "2023-10-31 08:33:26.337332"]]
---
  def create
    @kho = Kho.new(kho_params)

    if @kho.save

SELECT "khos".* FROM "khos" WHERE "khos"."id" = ? LIMIT ?  [["id", 123], ["LIMIT", 1]]
---
  def set_kho
    @kho = Kho.find(params[:id])