app/controllers/nha_cung_caps_controller.rb

  def index
    @nha_cung_caps = NhaCungCap.all
---
SELECT "nha_cung_caps".* FROM "nha_cung_caps"

  def create
    @nha_cung_cap = NhaCungCap.new(nha_cung_cap_params)

    if @nha_cung_cap.save
---
INSERT INTO "nha_cung_caps" ("MaNCC", "TenNCC", "SDT", "Fax", "DiaChi", "MaHD", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @nha_cung_cap.update(nha_cung_cap_params)
---
UPDATE "nha_cung_caps" SET "MaHD" = ?, "updated_at" = ? WHERE "nha_cung_caps"."id" = ?  [["MaHD", ""], ["updated_at", "2023-10-30 21:53:52.636977"], ["id", 1]]

  def set_nha_cung_cap
    @nha_cung_cap = NhaCungCap.find(params[:id])
---
SELECT "nha_cung_caps".* FROM "nha_cung_caps" WHERE "nha_cung_caps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]