app/controllers/quan_lys_controller.rb

  def index
    @quan_lies = QuanLy.all
---
SELECT "quan_lies".* FROM "quan_lies"

  def create
    @quan_ly = QuanLy.new(quan_ly_params)

    if @quan_ly.save
---
INSERT INTO "quan_lies" ("MaQL", "Ho", "Ten", "NgaySinh", "SDT", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["MaQL", "QL002"], ["Ho", "Nguyen"], ["Ten", "Phat"], ["NgaySinh", "2003-04-05"], ["SDT", "0934784137"], ["created_at", "2023-10-30 22:19:48.648042"], ["updated_at", "2023-10-30 22:19:48.648042"]]

  def set_quan_ly
    @quan_ly = QuanLy.find(params[:id])
---
SELECT "quan_lies".* FROM "quan_lies" WHERE "quan_lies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]